# 2. Introdução ao Pandas

## Importando a Biblioteca Pandas

In [161]:
import pandas as pd

## Criando Series

In [123]:
# Criando uma Série formada por nomes de alunos
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html
alunos_1 = pd.Series(['Diego  Alecsander', 'Giulia', 'Willian', 'Leonardo', 'Rodrigo', 'João Pedro', 'Flavia  Luize', 'Thales Vinicius'])
alunos_1

0    Diego  Alecsander
1               Giulia
2              Willian
3             Leonardo
4              Rodrigo
5           João Pedro
6        Flavia  Luize
7      Thales Vinicius
dtype: object

In [124]:
# Acessando um valor com índice de posição
alunos_1[0]

'Diego  Alecsander'

In [125]:
# Criando uma Série formada por nomes de alunos
# Especificando os índices para cada tipo: mestrado ou doutorado
alunos_2 = pd.Series(['Diego  Alecsander', 'Giulia', 'Willian', 'Leonardo', 'Rodrigo', 'João Pedro', 'Flavia  Luize', 'Thales Vinicius'],
                     index=['Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Mestrando'])
alunos_2

Mestrando     Diego  Alecsander
Doutorando               Giulia
Mestrando               Willian
Mestrando              Leonardo
Doutorando              Rodrigo
Mestrando            João Pedro
Mestrando         Flavia  Luize
Mestrando       Thales Vinicius
dtype: object

In [126]:
# Como utilizamos índices não exclusivos, 
# para acessar os valores de todos os 'mestrando' contidos na série:
alunos_2['Mestrando']

Mestrando    Diego  Alecsander
Mestrando              Willian
Mestrando             Leonardo
Mestrando           João Pedro
Mestrando        Flavia  Luize
Mestrando      Thales Vinicius
dtype: object

## Criando Dataframes

In [127]:
# Construindo um dataframe a partir de uma lista de elementos
df = pd.DataFrame([['Diego  Alecsander', 'Mestrando'],['Giulia', 'Doutorando'], ['Willian', 'Mestrando'], ['Leonardo', 'Mestrando'], ['Rodrigo', 'Doutorando'], ['João Pedro', 'Mestrando'], ['Flavia  Luize', 'Mestrando'], ['Thales Vinicius', 'Mestrando']])
df

                   0           1
0  Diego  Alecsander   Mestrando
1             Giulia  Doutorando
2            Willian   Mestrando
3           Leonardo   Mestrando
4            Rodrigo  Doutorando
5         João Pedro   Mestrando
6      Flavia  Luize   Mestrando
7    Thales Vinicius   Mestrando

In [128]:
# Construindo um dataframe a partir de um dicionário
data = {'Alunos': ['Diego  Alecsander', 'Giulia', 'Willian', 'Leonardo', 'Rodrigo', 'João Pedro', 'Flavia  Luize', 'Thales Vinicius'], 'Situação': ['Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Mestrando']}
df = pd.DataFrame(data)
df

              Alunos    Situação
0  Diego  Alecsander   Mestrando
1             Giulia  Doutorando
2            Willian   Mestrando
3           Leonardo   Mestrando
4            Rodrigo  Doutorando
5         João Pedro   Mestrando
6      Flavia  Luize   Mestrando
7    Thales Vinicius   Mestrando

## Manipulando Series e Dataframes

### Manipulando estruturas

In [129]:
# Removendo linhas de uma Serie
# Para remover, basta especificar o índice que deseja remover
# Seja o índice numérico ou textual
alunos_1.drop([3])

0    Diego  Alecsander
1               Giulia
2              Willian
4              Rodrigo
5           João Pedro
6        Flavia  Luize
7      Thales Vinicius
dtype: object

In [130]:
# Adicionando nova coluna no dataframe
data = {'Alunos': ['Diego  Alecsander', 'Giulia', 'Willian', 'Leonardo', 'Rodrigo', 'João Pedro', 'Flavia  Luize', 'Thales Vinicius'], 'Situação': ['Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Mestrando']}
df = pd.DataFrame(data)

df['Tipo de matrícula'] =  ['Especial', 'Regular', 'Especial', 'Especial', 'Regular', 'Especial', 'Especial', 'Especial']
df

              Alunos    Situação Tipo de matrícula
0  Diego  Alecsander   Mestrando          Especial
1             Giulia  Doutorando           Regular
2            Willian   Mestrando          Especial
3           Leonardo   Mestrando          Especial
4            Rodrigo  Doutorando           Regular
5         João Pedro   Mestrando          Especial
6      Flavia  Luize   Mestrando          Especial
7    Thales Vinicius   Mestrando          Especial

In [131]:
# Renomeando n colunas do dataframe
df.columns = ['Nomes', 'Situação', 'Matrícula']
df

               Nomes    Situação Matrícula
0  Diego  Alecsander   Mestrando  Especial
1             Giulia  Doutorando   Regular
2            Willian   Mestrando  Especial
3           Leonardo   Mestrando  Especial
4            Rodrigo  Doutorando   Regular
5         João Pedro   Mestrando  Especial
6      Flavia  Luize   Mestrando  Especial
7    Thales Vinicius   Mestrando  Especial

In [132]:
# Concatenando séries
a2 = pd.Series(['Camila'],
               index=['Doutoranda'])

alunos_2 = alunos_2.append(a2)
alunos_2

Mestrando     Diego  Alecsander
Doutorando               Giulia
Mestrando               Willian
Mestrando              Leonardo
Doutorando              Rodrigo
Mestrando            João Pedro
Mestrando         Flavia  Luize
Mestrando       Thales Vinicius
Doutoranda               Camila
dtype: object

In [133]:
# Concatenando dataframes
# Neste caso, o dataframe 'df1'será adicionado ao final do 'df'
# Logo, as colunas com dados ausentes ficam com o 'NaN'
df_copy = df

df1 = pd.DataFrame(
    {
        'Disciplina': ['BD', 'BD', 'BD'],
        'Nota': [9.5, 8.75, 9.0]
    },
    index=[0, 1, 2])

# O parâmetro ignore_index=True faz a concatenação dando sequencia do índice do
# dataframe que sofre a concatenação (no caso, 3, 4 e 5)
df = df.append(df1, ignore_index=True)
df

                Nomes    Situação Matrícula Disciplina  Nota
0   Diego  Alecsander   Mestrando  Especial        NaN   NaN
1              Giulia  Doutorando   Regular        NaN   NaN
2             Willian   Mestrando  Especial        NaN   NaN
3            Leonardo   Mestrando  Especial        NaN   NaN
4             Rodrigo  Doutorando   Regular        NaN   NaN
5          João Pedro   Mestrando  Especial        NaN   NaN
6       Flavia  Luize   Mestrando  Especial        NaN   NaN
7     Thales Vinicius   Mestrando  Especial        NaN   NaN
8                 NaN         NaN       NaN         BD  9.50
9                 NaN         NaN       NaN         BD  8.75
10                NaN         NaN       NaN         BD  9.00

In [134]:
# Uma opção para juntar varias colunas é utilizando o Merge
# Neste caso, utilizamos os índices de ambos dataframes
# para realizar tal junção
df_merge_col = pd.merge(df_copy, df1, left_index=True, right_index=True)

df_merge_col

               Nomes    Situação Matrícula Disciplina  Nota
0  Diego  Alecsander   Mestrando  Especial         BD  9.50
1             Giulia  Doutorando   Regular         BD  8.75
2            Willian   Mestrando  Especial         BD  9.00

### Informações sobre os objetos (series e dataframes)

In [135]:
# Numero de linhas da série 'alunos_2'
alunos_2.shape

(9,)

In [136]:
# Número de linhas e colunas do dataframe 'df'
df.shape

(11, 5)

In [137]:
# Índices da série 'alunos_2'
alunos_2.index

Index(['Mestrando', 'Doutorando', 'Mestrando', 'Mestrando', 'Doutorando',
       'Mestrando', 'Mestrando', 'Mestrando', 'Doutoranda'],
      dtype='object')

In [138]:
# Índices do dataframe 'df'
df.index

RangeIndex(start=0, stop=11, step=1)

In [139]:
# Series não tem colunas, logo este comando nao funciona 

#alunos_2.columns

In [140]:
# Nomes das colunas do dataframe 'df'
df.columns

Index(['Nomes', 'Situação', 'Matrícula', 'Disciplina', 'Nota'], dtype='object')

In [141]:
# Tipo dos dados na série 'alunos_2'
alunos_2.dtypes

dtype('O')

In [142]:
# Tipos dos dados no dataframe 'df'
df.dtypes

Nomes          object
Situação       object
Matrícula      object
Disciplina     object
Nota          float64
dtype: object

### Resumo dos dados

In [143]:
# Exibindo os n (=2) primeiros elementos da série 'artistas'
alunos_2.head(2)

Mestrando     Diego  Alecsander
Doutorando               Giulia
dtype: object

In [144]:
# Exibindo os n (=2) primeiros elementos do dataframe 'df'
df.head(2)

               Nomes    Situação Matrícula Disciplina  Nota
0  Diego  Alecsander   Mestrando  Especial        NaN   NaN
1             Giulia  Doutorando   Regular        NaN   NaN

In [145]:
# Exibindo os n (=2) últimos elementos da série 'artistas'
alunos_2.tail(2)

Mestrando     Thales Vinicius
Doutoranda             Camila
dtype: object

In [146]:
# Exibindo os n (=2) últimos elementos do dataframe 'df'
df.tail(2)

   Nomes Situação Matrícula Disciplina  Nota
9    NaN      NaN       NaN         BD  8.75
10   NaN      NaN       NaN         BD  9.00

In [147]:
# SOMA dos valores do índice 'Mestrando' da série alunos
# Como nesta série não possuimos valores, a soma se dá pela
# concatenação de strings
alunos_2['Mestrando'].sum()

'Diego  AlecsanderWillianLeonardoJoão PedroFlavia  LuizeThales Vinicius'

In [148]:
# SOMA dos valores da coluna 'Nota' do dataframe 'df'
df['Nota'].sum()

27.25

In [149]:
# Valor MÍNIMO da série 'Mestrando'
# Como é uma série de strings, o valor mínimo é o primeiro elemento
alunos_2.min()

'Camila'

In [150]:
# Valores MÍNIMOS do dataframe 'df'
# Como não foi especificado nenhuma coluna, todas as colunas numéricas
# foram retornadas com seus respectivos valores mínimos
df.min()

Nota    8.75
dtype: float64

In [151]:
# Valores MÁXIMOS da serie 'Mestrando'
# Como é uma série de strings, o valor máximo é o último elemento
alunos_2.max()

'Willian'

In [152]:
# Valores MÁXIMOS da coluna 'Nota' do dataframe 'df'
# se não especificarmos uma coluna, todas as colunas numéricas
# serão retornadas
df['Nota'].max()

9.5

In [153]:
# MÉDIA de valores da série 'Mestrando'
# como não possui valores numéricos, esta função não se aplica a esta série

#alunos_2.mean()

In [154]:
# MÉDIA de valores do dataframe 'df'
# Se quiser a média de uma única coluna, basta especificá-la
df.mean()

Nota    9.083333
dtype: float64

In [155]:
# MEDIANA dos valores da série 'Mestrando'
#como não possui valores numéricos, esta função não se aplica a esta série

#alunos_2.median()

In [156]:
# MEDIANA dos valores do dataframe 'df'
# Se quiser a mediana de uma única coluna, basta especificá-la
df.median()

Nota    9.0
dtype: float64

In [157]:
# CONTAGEM de elementos da série 'Mestrando'
alunos_2.count()

9

In [158]:
# CONTAGEM de elementos de cada coluna do dataframe 'df'
# Se quiser a contagem de uma única coluna, basta especificá-la
df.count()

Nomes         8
Situação      8
Matrícula     8
Disciplina    3
Nota          3
dtype: int64

In [159]:
# Resumo dos dados da série 'Mestrando'
# Note que as informações retornadas variam de acordo com
# os dados disponíveis
alunos_2.describe()

count          9
unique         9
top       Camila
freq           1
dtype: object

In [160]:
# Resumo dos dados d0 dataframe 'df'
# Note que as informações retornadas variam de acordo com
# os dados disponíveis
df.describe()

           Nota
count  3.000000
mean   9.083333
std    0.381881
min    8.750000
25%    8.875000
50%    9.000000
75%    9.250000
max    9.500000

## Fim da Parte 2. Introducao ao Pandas

Introdução à biblioteca pandas, apresentando como criar e manipular objetos do tipo series e dataframes.

O próximo notebook será a **Parte 3. Machine Learning Exemplo_1**.